notebook/app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes"
---
  def index
    @notes = Note.all

INSERT INTO "notes" ("content") VALUES (?)  [["content", "cheer up"]]
---
  def create
    @note = Note.new
    @note.content = params[:note][:content]

    if @note.save

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 1 LIMIT 1
---
  def edit
    @note = Note.find_by(id: params[:id])

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 1 LIMIT 1
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]
---
  def destroy
    @note = Note.find_by(id: params[:id])
    @note.destroy